{
  "projects": [
    {
      "id": "worldcheck-integration-system",
      "title": "End-to-End Project of JSON Scripts + SQL (MongoDB + SQL Server)",
      "description": "Comprehensive financial compliance system integrating third-party screening API for automated background verification. Features real-time sanctions screening, multi-database architecture (MongoDB + SQL Server).",
      "detailed_description": "Professional financial compliance platform developed for background screening using third-party screening API with comprehensive database integration. The system performs real-time sanctions and watchlist screening for individuals and organizations, featuring advanced data matching algorithms (from the company), parallel processing capabilities, and multi-database architecture supporting both MongoDB and SQL Server. Successfully processed multiple organizations with high API success rate and reliable performance metrics.",
      "features": [
        "Third-party screening API integration with secure HMAC-SHA256 authentication",
        "Multi-database architecture supporting MongoDB and SQL Server",
        "Real-time sanctions and watchlist screening for individuals and organizations",
        "Advanced data matching algorithms with high accuracy performance",
        "Parallel processing capabilities for high-volume data operations",
        "Automated case creation and management system",
        "Comprehensive audit logging and error handling",
        "Cross-database data synchronization and matching",
        "Production-ready workflow with retry mechanisms and rate limiting",
        "Complete organization screening workflow with case tracking"
      ], 
      "date": "June 2025",
      "readme": "Professional financial compliance system with Refinitiv API integration, multi-database support, and PowerBI Dashboard.",
      "role": "Professional Project",
      "team_size": "Two Interns with DS Director",
      "github_url": "",
      "demo_url": "",
      "documentation_url": "",
      "downloads": [],
      "screenshots": [
        {
          "url": "/static/images/refinitiv-api-architecture.png",
          "caption": "System architecture showing multi-database integration and API workflow"
        },
        {
          "url": "/static/images/data-matching-results.png",
          "caption": "Data matching results showing performance metrics"
        },
        {
          "url": "/static/images/organization-screening.png",
          "caption": "Organization screening workflow demonstration"
        }
      ],
      "key_metrics": [
        {
          "label": "API Success Rate",
          "value": "High",
          "description": "Reliable case creation and processing workflow"
        },
        {
          "label": "Data Matching Performance",
          "value": "Optimized",
          "description": "Efficient similarity matching between database tables"
        },
        {
          "label": "System Scalability",
          "value": "Multi-org",
          "description": "Successfully handles multiple organization workflows"
        },
        {
          "label": "Processing Efficiency",
          "value": "Fast",
          "description": "Optimized processing time per record"
        }
      ]
    },
    {
      "id": "gender-discrimination-lawsuit-analysis",
      "title": "Gender Discrimination Lawsuit Statistical Analysis",
      "description": "Comprehensive legal analytics project using R to analyze gender discrimination claims in academic medical institutions. Applied advanced statistical modeling, hypothesis testing, and machine learning techniques to examine salary and promotion patterns across 261 faculty records for court case evidence.",
      "detailed_description": "Real-world legal analytics project analyzing gender discrimination claims at Houston College of Medicine using comprehensive statistical methods in R. The analysis examined 261 faculty records across 6 departments, applying multiple statistical techniques including linear regression, logistic regression, ANOVA, t-tests, and machine learning feature importance analysis. Served as expert analytics consultant providing evidence-based conclusions for court proceedings, demonstrating practical application of statistical analysis in legal contexts.",
      "category": "Business Case Analysing",
      "technologies": ["R", "ggplot2", "dplyr", "tidyr", "Statistical Modeling", "Machine Learning", "Legal Analytics", "Court Evidence Analysis", "caret", "Hypothesis Testing"],
      "features": [
        "Analysis of 261 faculty records across 6 medical departments",
        "Multi-variable statistical modeling for salary and promotion patterns",
        "Advanced data visualization with ggplot2 for court presentation",
        "Hypothesis testing using t-tests and ANOVA for gender differences",
        "Linear and logistic regression with feature importance analysis",
        "Machine learning classification using caret package",
        "Statistical evidence preparation for legal proceedings",
        "Comprehensive correlation analysis and model diagnostics"
      ],
      "date": "October 2024",
      "readme": "Statistical analysis of gender discrimination in academic medical institutions using R and advanced statistical methods for legal evidence.",
      "role": "School Project",
      "team_size": "Individual Project",
      "demo_url": "",
      "documentation_url": "",
      "downloads": [
        {
          "name": "R Analysis Script",
          "url": "/downloads/lawsuit_analysis.R"
        },
        {
          "name": "Lawsuit Dataset",
          "url": "/downloads/lawsuit_data.csv"
        }
      ],
      "screenshots": [
        {
          "url": "/static/images/lawsuit-salary-analysis.png",
          "caption": "Salary distribution analysis by gender and department"
        },
        {
          "url": "/static/images/lawsuit-statistical-tests.png",
          "caption": "Hypothesis testing results and statistical significance"
        },
        {
          "url": "/static/images/lawsuit-feature-importance.png",
          "caption": "Machine learning feature importance for promotion prediction"
        }
      ],
      "image": "/static/images/lawsuit-analysis-preview.png"
    },
    {
      "id": "financial-services-ai-web-application",
      "title": "Financial Chatbot Services",
      "description": "Flask web application project built during coursework with AI integration for financial advice and market data visualization. Implemented basic user authentication and API connections as part of learning full-stack development.",
      "detailed_description": "Academic group project developing a Flask-based financial application with AI features. Learned to integrate Google Gemini AI API for basic financial advice responses and connected Alpha Vantage API for market data display. Implemented user login functionality and simple form validation. Project helped understand web development concepts including routing, templates, and API consumption during final semester coursework.",
      "category": "Artificial Intelligence",
      "technologies": ["Python", "Flask", "Flask-Login", "Flask-Limiter", "Google Gemini AI", "Alpha Vantage API", "AJAX", "HTML5", "CSS3", "JavaScript", "Session Management", "API Integration", "Security", "Gunicorn"],
      "features": [
        "AI-powered financial advisory system with personalized investment recommendations",
        "Real-time stock market data visualization and financial news integration",
        "24/7 AI customer support chatbot with conversation history tracking",
        "Advanced user authentication system with rate limiting and session security",
        "Modular Flask blueprint architecture for scalable code organization",
        "Investment simulation tools with compound interest calculations",
        "Responsive web design with professional UI/UX implementation",
        "Enterprise-grade error handling and fallback data systems",
        "API integration with comprehensive timeout and retry mechanisms",
        "Professional deployment configuration with Gunicorn and Gevent"
      ],
      "challenges": [
        "Integrating multiple external APIs (Google Gemini AI, Alpha Vantage) with robust error handling",
        "Implementing secure user authentication and session management with rate limiting",
        "Designing scalable Flask application architecture using blueprint patterns",
        "Creating responsive real-time data updates without overwhelming API rate limits",
        "Balancing AI response quality with performance optimization and timeout handling",
        "Ensuring data integrity and graceful degradation when external services are unavailable"
      ],
      "date": "February 2025",
      "duration": "4 weeks",
      "role": "School Project",
      "team_size": "4-person Academic Team (Group Project)",
      "github_url": "",
      "demo_url": "/financial-services-demo",
      "documentation_url": "",
      "downloads": [
        {
          "name": "Complete Flask Application",
          "url": "/downloads/financial_services_app.py"
        },
        {
          "name": "AI Engagement Module",
          "url": "/downloads/ai_engagement_system.py"
        },
        {
          "name": "Customer Support System",
          "url": "/downloads/ai_customer_support.py"
        },
        {
          "name": "Market Data Dashboard",
          "url": "/downloads/market_data_dashboard.py"
        },
        {
          "name": "Project Requirements",
          "url": "/downloads/financial_app_requirements.txt"
        }
      ],
      "screenshots": [
        {
          "url": "/static/images/financial-app-dashboard.png",
          "caption": "Real-time market data dashboard with live stock prices and financial news"
        },
        {
          "url": "/static/images/financial-app-ai-advisor.png",
          "caption": "AI financial advisor interface with personalized investment recommendations"
        },
        {
          "url": "/static/images/financial-app-architecture.png",
          "caption": "Flask blueprint architecture and AI integration system design"
        }
      ],
      "image": "/static/images/financial-services-preview.png"
    }
  ]
}
